data_generation/Case3/constant/cx
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "constant";
    object      cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar>
130184
(
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
-1.64973
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar>
78
(
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
-1.651
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar>
128
(
0.635
0.635
0.635
0.635
0.635
0.635
0.635
0.635
...
)
;
    }
    lowerWallStartup
    {
        type            symmetryPlane;
    }
    upperWallStartup
    {
        type            symmetryPlane;
    }
    upperWall
    {
        type            calculated;
        value           nonuniform List<scalar>
1353
(
0.000271892
0.000815677
0.00135946
0.00190325
0.00244703
0.00299081
0.0035346
0.00407838
...
)
;
    }
    lowerWall
    {
        type            calculated;
        value           nonuniform List<scalar>
1403
(
-0.000317644
-0.000953366
-0.00158996
-0.00222742
-0.00286575
-0.00350495
-0.00414503
-0.00478598
...
)
;
    }
    back
    {
        type            empty;
    }
    front
    {
        type            empty;
    }
}


// ************************************************************************* //
